# AddCorrectionFactor Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
TemperatureRatingType..::..AddCorrectionFactor Method
TemperatureRatingType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCorrectionFactor(Double, Double) | Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature. |
| AddCorrectionFactor(Int64, Double) | **Obsolete.** Add a new electrical correction factor type to this temperature rating type. |

# See Also
TemperatureRatingType Class
TemperatureRatingType Members
Autodesk.Revit.DB.Electrical Namespace